# Python vs PySpark Commands
*Python*


### Create a Pandas dataframe

In Python, if we want to create a dataframe, we need to import a library. Pandas is the most common library used for this. Let's create one now.

In [2]:
import pandas as pd 
  
# initialize list of lists 
data = [['tom', 10], ['nick', 15], ['juli', 14]] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['Name', 'Age'])

   Name  Age
0   tom   10
1  nick   15
2  juli   14

## Display the dataframe and it's properties

In [13]:
df.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    GOOG    Frank    340
3    MSFT     Tina    600
4    MSFT      Amy    124

In [3]:
# Get a list of columns
df.columns

Index(['Name', 'Age'], dtype='object')

In [12]:
# How many rows are in the dataframe?
len(df)

12

## Read in data

In [5]:
path = "C:/Users/583621/OneDrive - Booz Allen Hamilton/Learning and Programming/Python-and-Spark-for-Big-Data/Python-and-Spark-for-Big-Data-master/Pyspark_Essentials_EC/sales_info.csv"
df = pd.read_csv(path) 
df

   Company   Person  Sales
0     GOOG      Sam    200
1     GOOG  Charlie    120
2     GOOG    Frank    340
3     MSFT     Tina    600
4     MSFT      Amy    124
5     MSFT  Vanessa    243
6       FB     Carl    870
7       FB    Sarah    350
8     APPL     John    250
9     APPL    Linda    130
10    APPL     Mike    750
11    APPL    Chris    350

## Aggregate Data

In [8]:
df.groupby('Company').agg({'Sales': ['mean', 'min', 'max']})

              Sales
               mean  min  max
Company
APPL     370.000000  130  750
FB       610.000000  350  870
GOOG     220.000000  120  340
MSFT     322.333333  124  600